In [1]:
!ls

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [ ]:
#only works with os. Use !dir, or magic command %ls

In [2]:
print('hello world')

hello world

In [3]:
%ls

 Volume in drive C is Windows-SSD
 Volume Serial Number is C666-4787

 Directory of C:\Users\vinan

12/29/2025  12:45 AM    <DIR>          .
10/24/2025  12:45 AM    <DIR>          ..
02/24/2025  04:31 PM    <DIR>          .idlerc
12/29/2025  12:41 AM    <DIR>          .ipynb_checkpoints
12/28/2025  03:48 PM    <DIR>          .ipython
12/28/2025  03:43 PM    <DIR>          .jupyter
11/04/2024  12:03 PM    <DIR>          .ms-ad
10/24/2025  12:48 AM    <DIR>          Contacts
07/10/2024  10:32 AM    <DIR>          Documents
12/29/2025  12:31 AM    <DIR>          Downloads
10/24/2025  12:48 AM    <DIR>          Favorites
10/24/2025  12:48 AM    <DIR>          Links
10/24/2025  12:48 AM    <DIR>          Music
12/28/2025  11:49 PM    <DIR>          OneDrive
12/28/2025  03:41 PM                 0 Python Pandas practice.txt
10/24/2025  12:48 AM    <DIR>          Saved Games
10/24/2025  12:48 AM    <DIR>          Searches
12/28/2025  03:53 PM             1,631 Testing Jupyter.ipynb
12/29/2025  12:45 AM             1,300 Untitled.ipynb
10/24/2025  12:48 AM    <DIR>          Videos
               3 File(s)          2,931 bytes
              17 Dir(s)  152,717,086,720 bytes free

In [4]:
!dir

 Volume in drive C is Windows-SSD
 Volume Serial Number is C666-4787

 Directory of C:\Users\vinan

12/29/2025  12:45 AM    <DIR>          .
10/24/2025  12:45 AM    <DIR>          ..
02/24/2025  04:31 PM    <DIR>          .idlerc
12/29/2025  12:41 AM    <DIR>          .ipynb_checkpoints
12/28/2025  03:48 PM    <DIR>          .ipython
12/28/2025  03:43 PM    <DIR>          .jupyter
11/04/2024  12:03 PM    <DIR>          .ms-ad
10/24/2025  12:48 AM    <DIR>          Contacts
07/10/2024  10:32 AM    <DIR>          Documents
12/29/2025  12:31 AM    <DIR>          Downloads
10/24/2025  12:48 AM    <DIR>          Favorites
10/24/2025  12:48 AM    <DIR>          Links
10/24/2025  12:48 AM    <DIR>          Music
12/28/2025  11:49 PM    <DIR>          OneDrive
12/28/2025  03:41 PM                 0 Python Pandas practice.txt
10/24/2025  12:48 AM    <DIR>          Saved Games
10/24/2025  12:48 AM    <DIR>          Searches
12/28/2025  03:53 PM             1,631 Testing Jupyter.ipynb
12/29/2025  12:45 AM             1,300 Untitled.ipynb
10/24/2025  12:48 AM    <DIR>          Videos
               3 File(s)          2,931 bytes
              17 Dir(s)  152,738,865,152 bytes free

In [7]:
import pandas as pd

In [9]:
df = pd.read_csv('customers.csv')

In [6]:
#df.head()

NameError: name 'df' is not defined

In [10]:
df.head

<bound method NDFrame.head of        ID First Name Last Name         Phone          LTV
0    4576     Sophia    Walker  602-310-9331     $496.87
1    9488     Evelyn    Harris  171-363-6978  $38,424.41
2    7265      Lucas    Foster  139-658-8905  $14,413.64
3    8555     Elijah     Jones  538-241-9868  $13,440.49
4    7023      Mason    Taylor  937-595-5837   $1,777.37
..    ...        ...       ...           ...          ...
995  7099      David    Harris  809-428-6034  $12,799.04
996  6743      Henry     Reyes  999-363-7716  $11,043.94
997  3513     Olivia   Sanders             ?  $10,206.00
998  4307       Emma       Cox  748-415-4613   $9,839.57
999  9062      Henry     Brown  412-368-2550  $14,686.60

[1000 rows x 5 columns]>

In [11]:
df.head()

     ID First Name Last Name         Phone          LTV
0  4576     Sophia    Walker  602-310-9331     $496.87
1  9488     Evelyn    Harris  171-363-6978  $38,424.41
2  7265      Lucas    Foster  139-658-8905  $14,413.64
3  8555     Elijah     Jones  538-241-9868  $13,440.49
4  7023      Mason    Taylor  937-595-5837   $1,777.37

In [12]:
df.tail()

       ID First Name Last Name         Phone          LTV
995  7099      David    Harris  809-428-6034  $12,799.04
996  6743      Henry     Reyes  999-363-7716  $11,043.94
997  3513     Olivia   Sanders             ?  $10,206.00
998  4307       Emma       Cox  748-415-4613   $9,839.57
999  9062      Henry     Brown  412-368-2550  $14,686.60

In [13]:
!dir

 Volume in drive C is Windows-SSD
 Volume Serial Number is C666-4787

 Directory of C:\Users\vinan

12/29/2025  12:57 AM    <DIR>          .
10/24/2025  12:45 AM    <DIR>          ..
02/24/2025  04:31 PM    <DIR>          .idlerc
12/29/2025  12:41 AM    <DIR>          .ipynb_checkpoints
12/28/2025  03:48 PM    <DIR>          .ipython
12/28/2025  03:43 PM    <DIR>          .jupyter
11/04/2024  12:03 PM    <DIR>          .ms-ad
10/24/2025  12:48 AM    <DIR>          Contacts
12/29/2025  12:31 AM            45,067 customers.csv
07/10/2024  10:32 AM    <DIR>          Documents
12/29/2025  12:31 AM    <DIR>          Downloads
10/24/2025  12:48 AM    <DIR>          Favorites
10/24/2025  12:48 AM    <DIR>          Links
10/24/2025  12:48 AM    <DIR>          Music
12/28/2025  11:49 PM    <DIR>          OneDrive
12/28/2025  03:41 PM                 0 Python Pandas practice.txt
10/24/2025  12:48 AM    <DIR>          Saved Games
10/24/2025  12:48 AM    <DIR>          Searches
12/28/2025  03:53 PM             1,631 Testing Jupyter.ipynb
12/29/2025  12:57 AM             7,465 Untitled.ipynb
10/24/2025  12:48 AM    <DIR>          Videos
               4 File(s)         54,163 bytes
              17 Dir(s)  152,759,713,792 bytes free

In [23]:
df = pd.read_csv('downloads/customers.csv')
index_

NameError: name 'index_' is not defined

In [26]:
df = pd.read_csv('downloads/customers.csv')
index_col = id

In [27]:
df.head()

     ID First Name Last Name         Phone          LTV
0  4576     Sophia    Walker  602-310-9331     $496.87
1  9488     Evelyn    Harris  171-363-6978  $38,424.41
2  7265      Lucas    Foster  139-658-8905  $14,413.64
3  8555     Elijah     Jones  538-241-9868  $13,440.49
4  7023      Mason    Taylor  937-595-5837   $1,777.37

In [20]:
df_url = pd.read_csv('https://raw.githubusercontent.com/kimfetti/Videos/refs/heads/master/Pandas_Tips/data/customers.csv')

In [21]:
df_url(head)

NameError: name 'head' is not defined

In [22]:
df_url.head()

     ID First Name Last Name         Phone          LTV
0  4576     Sophia    Walker  602-310-9331     $496.87
1  9488     Evelyn    Harris  171-363-6978  $38,424.41
2  7265      Lucas    Foster  139-658-8905  $14,413.64
3  8555     Elijah     Jones  538-241-9868  $13,440.49
4  7023      Mason    Taylor  937-595-5837   $1,777.37

In [49]:
df = pd.read_csv(
    'downloads/customers.csv',
    index_col = 'ID',
    na_values = '?',
    nrows=100
)

In [32]:
df.head()

     First Name Last Name         Phone          LTV
ID
4576     Sophia    Walker  602-310-9331     $496.87
9488     Evelyn    Harris  171-363-6978  $38,424.41
7265      Lucas    Foster  139-658-8905  $14,413.64
8555     Elijah     Jones  538-241-9868  $13,440.49
7023      Mason    Taylor  937-595-5837   $1,777.37

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 4576 to 9062
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Last Name   1000 non-null   object
 2   Phone       968 non-null    object
 3   LTV         986 non-null    object
dtypes: object(4)
memory usage: 39.1+ KB

In [35]:
df.Phone.value_counts()

Phone
?               31
677-742-5739     1
412-368-2550     1
602-310-9331     1
171-363-6978     1
                ..
339-886-2967     1
809-428-6034     1
999-363-7716     1
748-415-4613     1
778-262-5262     1
Name: count, Length: 938, dtype: int64

In [36]:
df.LTV.value_counts()

LTV
?              12
$13,440.49      1
$1,777.37       1
$21,446.57      1
$12,540.32      1
               ..
$12,799.04      1
$11,043.94      1
$10,206.00      1
$9,839.57       1
$14,413.64      1
Name: count, Length: 975, dtype: int64

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 4576 to 9062
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Last Name   1000 non-null   object
 2   Phone       937 non-null    object
 3   LTV         974 non-null    object
dtypes: object(4)
memory usage: 39.1+ KB

In [45]:
df.Phone.value_counts()

Phone
602-310-9331    1
171-363-6978    1
139-658-8905    1
538-241-9868    1
937-595-5837    1
               ..
339-886-2967    1
809-428-6034    1
999-363-7716    1
748-415-4613    1
412-368-2550    1
Name: count, Length: 937, dtype: int64

In [47]:
df.shape

(1000, 4)

In [48]:
df.tail()

     First Name Last Name         Phone          LTV
ID
7099      David    Harris  809-428-6034  $12,799.04
6743      Henry     Reyes  999-363-7716  $11,043.94
3513     Olivia   Sanders           NaN  $10,206.00
4307       Emma       Cox  748-415-4613   $9,839.57
9062      Henry     Brown  412-368-2550  $14,686.60

In [50]:
df.tail()

     First Name Last Name         Phone         LTV
ID
2229       Emma   Simmons  613-834-3513  $4,538.32
5039        Ava     Brown  170-576-6081    $422.52
2263   Victoria     Smith  971-297-2895  $5,829.51
9232      Lucas     Perry  534-290-4258  $7,243.49
8922     Joseph  Mitchell           NaN  $3,721.42

In [52]:
df = pd.read_csv('downloads/pet_data.csv')

In [53]:
df.head()

      name pet_type   food_type amount    brand
0    Simba   Lizard     Insects   212g      NaN
1  Winston   Ferret    Dry Food    NaN  Pawsome
2    Bella   Parrot       Seeds    NaN      NaN
3   Shadow  Hamster     Pellets    58g      NaN
4     Milo   Rabbit  Vegetables   124g      NaN

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       491 non-null    object
 1   pet_type   490 non-null    object
 2   food_type  434 non-null    object
 3   amount     388 non-null    object
 4   brand      85 non-null     object
dtypes: object(5)
memory usage: 19.7+ KB

In [55]:
df.brand.value_counts()

brand
SnackLand        13
Pawsome          12
YummyDelight     12
ChowTime         10
PetPerfection    10
TropicalFeast    10
GreenHarvest      9
GrainyGraze       9
Name: count, dtype: int64

In [56]:
df.isnull().values.any()

np.True_

In [59]:
import seaborn as sns

In [58]:
import seaborn as sns

In [60]:
df.shape

(500, 5)

In [61]:
df.dropna()

        name    pet_type   food_type amount          brand
9      Tiger        Fish     Pellets   173g       ChowTime
18   Charlie         Dog  Dry Kibble    84g   GreenHarvest
19    Harley         Cat    Wet Food    90g        Pawsome
21    Jasper      Rabbit         Hay    37g      SnackLand
23   Mittens         Dog    Wet Food    91g  TropicalFeast
31   Winston        Fish     Pellets    37g    GrainyGraze
38     Penny  Guinea Pig     Pellets   119g  TropicalFeast
46      Nala      Parrot     Pellets    31g    GrainyGraze
57      Loki         Dog    Wet Food   173g        Pawsome
74       Zoe     Hamster       Seeds    49g   YummyDelight
75      Finn      Lizard     Pellets    94g    GrainyGraze
112     Ruby      Ferret    Wet Food   182g        Pawsome
122    Simba       Snake     Rodents    25g      SnackLand
129      Leo         Cat  Dry Kibble   114g    GrainyGraze
134     Lola      Parrot       Seeds    68g   YummyDelight
138  Charlie      Lizard     Pellets   137g    GrainyGraze
142   Sophie         Cat  Dry Kibble   143g        Pawsome
145    Kitty      Parrot       Seeds   171g       ChowTime
153   Stella       Snake        Eggs   138g   GreenHarvest
159     Zeus      Rabbit         Hay    33g   GreenHarvest
178     Lola        Bird       Seeds    28g      SnackLand
185    Simba      Rabbit         Hay   155g    GrainyGraze
191     Zeus     Hamster       Seeds   243g        Pawsome
192  Winston         Cat  Dry Kibble   103g  TropicalFeast
211     Zeus        Fish     Pellets    63g       ChowTime
219    Riley         Cat  Dry Kibble   123g      SnackLand
227     Coco      Turtle  Vegetables    73g   GreenHarvest
232    Sadie        Fish     Pellets    61g   GreenHarvest
235    Oscar         Cat  Dry Kibble   112g   YummyDelight
253     Loki      Lizard     Pellets   115g   YummyDelight
254  Winston      Turtle  Vegetables    53g        Pawsome
257     Ruby       Snake     Rodents    99g   GreenHarvest
264  Charlie      Parrot       Seeds   232g  PetPerfection
267    Oscar     Hamster       Seeds   144g  TropicalFeast
274     Cleo      Parrot       Seeds   215g  TropicalFeast
292   Stella         Dog  Dry Kibble   107g   YummyDelight
303     Coco  Guinea Pig     Pellets   146g  PetPerfection
306    Riley       Snake     Rodents    94g  TropicalFeast
322   Oliver         Cat  Dry Kibble   214g   YummyDelight
326     Lulu      Turtle     Pellets   201g       ChowTime
355     Finn       Snake        Eggs   184g       ChowTime
356     Nala      Lizard     Pellets   137g  TropicalFeast
357    Riley      Parrot       Seeds   208g    GrainyGraze
368     Lucy         Cat    Wet Food    46g      SnackLand
391     Lily     Hamster       Seeds   226g      SnackLand
404     Nala      Lizard     Insects   215g      SnackLand
423   Sophie      Parrot     Pellets    94g  PetPerfection
426     Finn      Lizard     Pellets   133g  PetPerfection
436    Simba     Hamster       Seeds   182g  TropicalFeast
447  Charlie      Ferret    Wet Food   109g  PetPerfection
464    Tiger      Parrot       Seeds   166g   GreenHarvest
466    Mocha        Fish     Pellets   133g   GreenHarvest
483  Charlie      Parrot       Seeds   223g  PetPerfection
489    Rocky      Lizard     Insects   135g       ChowTime
492     Luna      Lizard     Pellets   223g  PetPerfection
495   Shadow         Dog    Wet Food   229g  TropicalFeast

In [62]:
df.shape

(500, 5)

In [64]:
df.dropna().shape

(56, 5)

In [70]:

df1 = pd.DataFrame({
    'A': [1, 2, None],
    'B': [4, None, 6]
    
    })

# Drop rows with any NaN values
df1_cleaned = df1.dropna()

In [72]:
df1_cleaned.head()

     A    B
0  1.0  4.0

In [73]:
df.shape()

TypeError: 'tuple' object is not callable

In [74]:
df.shape

(500, 5)

In [75]:
df.dropna(how = 'all')

        name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[496 rows x 5 columns]

In [76]:
df.dropna(subset='name')

        name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[491 rows x 5 columns]

In [77]:
df.dropna(axis=1,how = 'all')

        name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[500 rows x 5 columns]

In [82]:
missing_threshold = df.shape(0)*.5

TypeError: 'tuple' object is not callable

In [81]:
df.shape(0)

TypeError: 'tuple' object is not callable

In [90]:
df.shape(0)*.5

TypeError: 'tuple' object is not callable

In [84]:
missing_threshold = df.shape[0]*.5

In [86]:
df.shape[0]

500

In [87]:
df.shape[1]

5

In [88]:
missing threshaold

SyntaxError: invalid syntax (536925440.py, line 1)

In [91]:
missing_threshold

250.0

In [92]:
missing_threshold

250.0

In [93]:
gfdfgdshfsghf

NameError: name 'gfdfgdshfsghf' is not defined

In [96]:
## markdown
This notebook demonstrates two approaches to pricing European FX options:
1. The analytical Black-Scholes model
2. A Monte Carlo simulation

We'll compare their outputs and visualize the convergence behavior of the simulation.

SyntaxError: unterminated string literal (detected at line 6) (2788369119.py, line 6)

In [98]:
# FX Options Pricing with Black-Scholes and Monte Carlo

This notebook demonstrates two approaches to pricing European FX options:
1. The analytical Black-Scholes model
2. A Monte Carlo simulation

We will compare their outputs and visualize the convergence behavior of the simulation.

SyntaxError: invalid syntax (3175816750.py, line 3)

*xfvkjxlvjjvdfjdbj*

**DFBcbcbc**

[click here](google.com)

In [103]:
symbol = "AAPL"
df = yf.download(symbol, start="2020-01-01", auto_adjust=True)

[*********************100%***********************]  1 of 1 completed

In [102]:
import yfinance as yf

In [104]:
df.head()

Price           Close       High        Low       Open     Volume
Ticker           AAPL       AAPL       AAPL       AAPL       AAPL
Date
2020-01-02  72.468262  72.528582  71.223259  71.476600  135480400
2020-01-03  71.763710  72.523738  71.539322  71.696152  146322800
2020-01-06  72.335548  72.374154  70.634532  70.885464  118387200
2020-01-07  71.995369  72.600975  71.775804  72.345220  108872000
2020-01-08  73.153503  73.455103  71.698589  71.698589  132079200

In [105]:
df.head

<bound method NDFrame.head of Price            Close        High         Low        Open     Volume
Ticker            AAPL        AAPL        AAPL        AAPL       AAPL
Date
2020-01-02   72.468262   72.528582   71.223259   71.476600  135480400
2020-01-03   71.763710   72.523738   71.539322   71.696152  146322800
2020-01-06   72.335548   72.374154   70.634532   70.885464  118387200
2020-01-07   71.995369   72.600975   71.775804   72.345220  108872000
2020-01-08   73.153503   73.455103   71.698589   71.698589  132079200
...                ...         ...         ...         ...        ...
2025-12-22  270.970001  273.880005  270.510010  272.859985   36571800
2025-12-23  272.359985  272.500000  269.559998  270.839996   29642000
2025-12-24  273.809998  275.429993  272.200012  272.339996   17910600
2025-12-26  273.399994  275.369995  272.859985  274.160004   21455300
2025-12-29  273.760010  274.359985  272.350006  274.230011   23399554

[1506 rows x 5 columns]>

In [106]:
df.shape

(1506, 5)

In [107]:
display(df)

Price            Close        High         Low        Open     Volume
Ticker            AAPL        AAPL        AAPL        AAPL       AAPL
Date
2020-01-02   72.468262   72.528582   71.223259   71.476600  135480400
2020-01-03   71.763710   72.523738   71.539322   71.696152  146322800
2020-01-06   72.335548   72.374154   70.634532   70.885464  118387200
2020-01-07   71.995369   72.600975   71.775804   72.345220  108872000
2020-01-08   73.153503   73.455103   71.698589   71.698589  132079200
...                ...         ...         ...         ...        ...
2025-12-22  270.970001  273.880005  270.510010  272.859985   36571800
2025-12-23  272.359985  272.500000  269.559998  270.839996   29642000
2025-12-24  273.809998  275.429993  272.200012  272.339996   17910600
2025-12-26  273.399994  275.369995  272.859985  274.160004   21455300
2025-12-29  273.760010  274.359985  272.350006  274.230011   23399554

[1506 rows x 5 columns]

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1506 entries, 2020-01-02 to 2025-12-29
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   (Close, AAPL)   1506 non-null   float64
 1   (High, AAPL)    1506 non-null   float64
 2   (Low, AAPL)     1506 non-null   float64
 3   (Open, AAPL)    1506 non-null   float64
 4   (Volume, AAPL)  1506 non-null   int64
dtypes: float64(4), int64(1)
memory usage: 70.6 KB

In [109]:
df.tail()

Price            Close        High         Low        Open    Volume
Ticker            AAPL        AAPL        AAPL        AAPL      AAPL
Date
2025-12-22  270.970001  273.880005  270.510010  272.859985  36571800
2025-12-23  272.359985  272.500000  269.559998  270.839996  29642000
2025-12-24  273.809998  275.429993  272.200012  272.339996  17910600
2025-12-26  273.399994  275.369995  272.859985  274.160004  21455300
2025-12-29  273.760010  274.359985  272.350006  274.230011  23399554

In [111]:
df.shape[0]

1506

In [112]:
len(df)

1506

In [114]:
symbol.financials

AttributeError: 'str' object has no attribute 'financials'

In [115]:
stock = yf.Ticker('msft')

In [116]:
stock.financials

,2025-06-30,2024-06-30,2023-06-30,2022-06-30
Tax Effect Of Unusual Items,-7.708800e+07,-9.991800e+07,-2.850000e+06,4.375400e+07
Tax Rate For Calcs,1.760000e-01,1.820000e-01,1.900000e-01,1.310000e-01
Normalized EBITDA,1.606030e+11,1.335580e+11,1.051550e+11,9.990500e+10
Total Unusual Items,-4.380000e+08,-5.490000e+08,-1.500000e+07,3.340000e+08
Total Unusual Items Excluding Goodwill,-4.380000e+08,-5.490000e+08,-1.500000e+07,3.340000e+08
Net Income From Continuing Operation Net Minority Interest,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Reconciled Depreciation,3.415300e+10,2.228700e+10,1.386100e+10,1.446000e+10
Reconciled Cost Of Revenue,8.783100e+10,7.411400e+10,6.586300e+10,6.265000e+10
EBITDA,1.601650e+11,1.330090e+11,1.051400e+11,1.002390e+11
EBIT,1.260120e+11,1.107220e+11,9.127900e+10,8.577900e+10
Net Interest Income,2.620000e+08,2.220000e+08,1.026000e+09,3.100000e+07
Interest Expense,2.385000e+09,2.935000e+09,1.968000e+09,2.063000e+09
Interest Income,2.647000e+09,3.157000e+09,2.994000e+09,2.094000e+09
Normalized Income,1.021929e+11,8.858508e+10,7.237315e+10,7.244775e+10
Net Income From Continuing And Discontinued Operation,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Total Expenses,1.531960e+11,1.356890e+11,1.233920e+11,1.148870e+11
Total Operating Income As Reported,1.285280e+11,1.094330e+11,8.852300e+10,8.338300e+10
Diluted Average Shares,7.465000e+09,7.469000e+09,7.472000e+09,7.540000e+09
Basic Average Shares,7.433000e+09,7.431000e+09,7.446000e+09,7.496000e+09
Diluted EPS,1.364000e+01,1.180000e+01,9.680000e+00,9.650000e+00
Basic EPS,1.370000e+01,1.186000e+01,9.720000e+00,9.700000e+00
Diluted NI Availto Com Stockholders,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Net Income Common Stockholders,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Net Income,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Net Income Including Noncontrolling Interests,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Net Income Continuous Operations,1.018320e+11,8.813600e+10,7.236100e+10,7.273800e+10
Tax Provision,2.179500e+10,1.965100e+10,1.695000e+10,1.097800e+10
Pretax Income,1.236270e+11,1.077870e+11,8.931100e+10,8.371600e+10
Other Income Expense,-5.163000e+09,-1.868000e+09,-2.380000e+08,3.020000e+08
Other Non Operating Income Expenses,-4.725000e+09,-1.319000e+09,-2.230000e+08,-3.200000e+07
Special Income Charges,-9.430000e+08,-2.060000e+08,-3.000000e+07,-1.010000e+08
Write Off,9.430000e+08,2.060000e+08,3.000000e+07,1.010000e+08
Gain On Sale Of Security,5.050000e+08,-3.430000e+08,1.500000e+07,4.350000e+08
Net Non Operating Interest Income Expense,2.620000e+08,2.220000e+08,1.026000e+09,3.100000e+07
Interest Expense Non Operating,2.385000e+09,2.935000e+09,1.968000e+09,2.063000e+09
Interest Income Non Operating,2.647000e+09,3.157000e+09,2.994000e+09,2.094000e+09
Operating Income,1.285280e+11,1.094330e+11,8.852300e+10,8.338300e+10
Operating Expense,6.536500e+10,6.157500e+10,5.752900e+10,5.223700e+10
Research And Development,3.248800e+10,2.951000e+10,2.719500e+10,2.451200e+10
Selling General And Administration,3.287700e+10,3.206500e+10,3.033400e+10,2.772500e+10
Selling And Marketing Expense,2.565400e+10,2.445600e+10,2.275900e+10,2.182500e+10
General And Administrative Expense,7.223000e+09,7.609000e+09,7.575000e+09,5.900000e+09
Other Gand A,7.223000e+09,7.609000e+09,7.575000e+09,5.900000e+09
Gross Profit,1.938930e+11,1.710080e+11,1.460520e+11,1.356200e+11
Cost Of Revenue,8.783100e+10,7.411400e+10,6.586300e+10,6.265000e+10
Total Revenue,2.817240e+11,2.451220e+11,2.119150e+11,1.982700e+11
Operating Revenue,2.817240e+11,2.451220e+11,2.119150e+11,1.982700e+11

In [118]:
import talib

In [119]:
print(talib.get_functions())  # Should list 150+ indicators

['HT_DCPERIOD', 'HT_DCPHASE', 'HT_PHASOR', 'HT_SINE', 'HT_TRENDMODE', 'ADD', 'DIV', 'MAX', 'MAXINDEX', 'MIN', 'MININDEX', 'MINMAX', 'MINMAXINDEX', 'MULT', 'SUB', 'SUM', 'ACOS', 'ASIN', 'ATAN', 'CEIL', 'COS', 'COSH', 'EXP', 'FLOOR', 'LN', 'LOG10', 'SIN', 'SINH', 'SQRT', 'TAN', 'TANH', 'ADX', 'ADXR', 'APO', 'AROON', 'AROONOSC', 'BOP', 'CCI', 'CMO', 'DX', 'MACD', 'MACDEXT', 'MACDFIX', 'MFI', 'MINUS_DI', 'MINUS_DM', 'MOM', 'PLUS_DI', 'PLUS_DM', 'PPO', 'ROC', 'ROCP', 'ROCR', 'ROCR100', 'RSI', 'STOCH', 'STOCHF', 'STOCHRSI', 'TRIX', 'ULTOSC', 'WILLR', 'BBANDS', 'DEMA', 'EMA', 'HT_TRENDLINE', 'KAMA', 'MA', 'MAMA', 'MAVP', 'MIDPOINT', 'MIDPRICE', 'SAR', 'SAREXT', 'SMA', 'T3', 'TEMA', 'TRIMA', 'WMA', 'CDL2CROWS', 'CDL3BLACKCROWS', 'CDL3INSIDE', 'CDL3LINESTRIKE', 'CDL3OUTSIDE', 'CDL3STARSINSOUTH', 'CDL3WHITESOLDIERS', 'CDLABANDONEDBABY', 'CDLADVANCEBLOCK', 'CDLBELTHOLD', 'CDLBREAKAWAY', 'CDLCLOSINGMARUBOZU', 'CDLCONCEALBABYSWALL', 'CDLCOUNTERATTACK', 'CDLDARKCLOUDCOVER', 'CDLDOJI', 'CDLDOJISTAR', 'CDLDRAGONFLYDOJI', 'CDLENGULFING', 'CDLEVENINGDOJISTAR', 'CDLEVENINGSTAR', 'CDLGAPSIDESIDEWHITE', 'CDLGRAVESTONEDOJI', 'CDLHAMMER', 'CDLHANGINGMAN', 'CDLHARAMI', 'CDLHARAMICROSS', 'CDLHIGHWAVE', 'CDLHIKKAKE', 'CDLHIKKAKEMOD', 'CDLHOMINGPIGEON', 'CDLIDENTICAL3CROWS', 'CDLINNECK', 'CDLINVERTEDHAMMER', 'CDLKICKING', 'CDLKICKINGBYLENGTH', 'CDLLADDERBOTTOM', 'CDLLONGLEGGEDDOJI', 'CDLLONGLINE', 'CDLMARUBOZU', 'CDLMATCHINGLOW', 'CDLMATHOLD', 'CDLMORNINGDOJISTAR', 'CDLMORNINGSTAR', 'CDLONNECK', 'CDLPIERCING', 'CDLRICKSHAWMAN', 'CDLRISEFALL3METHODS', 'CDLSEPARATINGLINES', 'CDLSHOOTINGSTAR', 'CDLSHORTLINE', 'CDLSPINNINGTOP', 'CDLSTALLEDPATTERN', 'CDLSTICKSANDWICH', 'CDLTAKURI', 'CDLTASUKIGAP', 'CDLTHRUSTING', 'CDLTRISTAR', 'CDLUNIQUE3RIVER', 'CDLUPSIDEGAP2CROWS', 'CDLXSIDEGAP3METHODS', 'AVGPRICE', 'MEDPRICE', 'TYPPRICE', 'WCLPRICE', 'BETA', 'CORREL', 'LINEARREG', 'LINEARREG_ANGLE', 'LINEARREG_INTERCEPT', 'LINEARREG_SLOPE', 'STDDEV', 'TSF', 'VAR', 'ATR', 'NATR', 'TRANGE', 'AD', 'ADOSC', 'OBV']

In [121]:
talib.get_functions()

['HT_DCPERIOD',
 'HT_DCPHASE',
 'HT_PHASOR',
 'HT_SINE',
 'HT_TRENDMODE',
 'ADD',
 'DIV',
 'MAX',
 'MAXINDEX',
 'MIN',
 'MININDEX',
 'MINMAX',
 'MINMAXINDEX',
 'MULT',
 'SUB',
 'SUM',
 'ACOS',
 'ASIN',
 'ATAN',
 'CEIL',
 'COS',
 'COSH',
 'EXP',
 'FLOOR',
 'LN',
 'LOG10',
 'SIN',
 'SINH',
 'SQRT',
 'TAN',
 'TANH',
 'ADX',
 'ADXR',
 'APO',
 'AROON',
 'AROONOSC',
 'BOP',
 'CCI',
 'CMO',
 'DX',
 'MACD',
 'MACDEXT',
 'MACDFIX',
 'MFI',
 'MINUS_DI',
 'MINUS_DM',
 'MOM',
 'PLUS_DI',
 'PLUS_DM',
 'PPO',
 'ROC',
 'ROCP',
 'ROCR',
 'ROCR100',
 'RSI',
 'STOCH',
 'STOCHF',
 'STOCHRSI',
 'TRIX',
 'ULTOSC',
 'WILLR',
 'BBANDS',
 'DEMA',
 'EMA',
 'HT_TRENDLINE',
 'KAMA',
 'MA',
 'MAMA',
 'MAVP',
 'MIDPOINT',
 'MIDPRICE',
 'SAR',
 'SAREXT',
 'SMA',
 'T3',
 'TEMA',
 'TRIMA',
 'WMA',
 'CDL2CROWS',
 'CDL3BLACKCROWS',
 'CDL3INSIDE',
 'CDL3LINESTRIKE',
 'CDL3OUTSIDE',
 'CDL3STARSINSOUTH',
 'CDL3WHITESOLDIERS',
 'CDLABANDONEDBABY',
 'CDLADVANCEBLOCK',
 'CDLBELTHOLD',
 'CDLBREAKAWAY',
 'CDLCLOSINGMARUBOZU',
 'CDLCONCEALBABYSWALL',
 'CDLCOUNTERATTACK',
 'CDLDARKCLOUDCOVER',
 'CDLDOJI',
 'CDLDOJISTAR',
 'CDLDRAGONFLYDOJI',
 'CDLENGULFING',
 'CDLEVENINGDOJISTAR',
 'CDLEVENINGSTAR',
 'CDLGAPSIDESIDEWHITE',
 'CDLGRAVESTONEDOJI',
 'CDLHAMMER',
 'CDLHANGINGMAN',
 'CDLHARAMI',
 'CDLHARAMICROSS',
 'CDLHIGHWAVE',
 'CDLHIKKAKE',
 'CDLHIKKAKEMOD',
 'CDLHOMINGPIGEON',
 'CDLIDENTICAL3CROWS',
 'CDLINNECK',
 'CDLINVERTEDHAMMER',
 'CDLKICKING',
 'CDLKICKINGBYLENGTH',
 'CDLLADDERBOTTOM',
 'CDLLONGLEGGEDDOJI',
 'CDLLONGLINE',
 'CDLMARUBOZU',
 'CDLMATCHINGLOW',
 'CDLMATHOLD',
 'CDLMORNINGDOJISTAR',
 'CDLMORNINGSTAR',
 'CDLONNECK',
 'CDLPIERCING',
 'CDLRICKSHAWMAN',
 'CDLRISEFALL3METHODS',
 'CDLSEPARATINGLINES',
 'CDLSHOOTINGSTAR',
 'CDLSHORTLINE',
 'CDLSPINNINGTOP',
 'CDLSTALLEDPATTERN',
 'CDLSTICKSANDWICH',
 'CDLTAKURI',
 'CDLTASUKIGAP',
 'CDLTHRUSTING',
 'CDLTRISTAR',
 'CDLUNIQUE3RIVER',
 'CDLUPSIDEGAP2CROWS',
 'CDLXSIDEGAP3METHODS',
 'AVGPRICE',
 'MEDPRICE',
 'TYPPRICE',
 'WCLPRICE',
 'BETA',
 'CORREL',
 'LINEARREG',
 'LINEARREG_ANGLE',
 'LINEARREG_INTERCEPT',
 'LINEARREG_SLOPE',
 'STDDEV',
 'TSF',
 'VAR',
 'ATR',
 'NATR',
 'TRANGE',
 'AD',
 'ADOSC',
 'OBV']

In [124]:
import QuantLib as ql

In [125]:
ql.get_functions()

AttributeError: module 'QuantLib' has no attribute 'get_functions'

In [126]:
ql.__version__

'1.40'

In [129]:
df.duplicated

<bound method DataFrame.duplicated of Price            Close        High         Low        Open     Volume
Ticker            AAPL        AAPL        AAPL        AAPL       AAPL
Date
2020-01-02   72.468262   72.528582   71.223259   71.476600  135480400
2020-01-03   71.763710   72.523738   71.539322   71.696152  146322800
2020-01-06   72.335548   72.374154   70.634532   70.885464  118387200
2020-01-07   71.995369   72.600975   71.775804   72.345220  108872000
2020-01-08   73.153503   73.455103   71.698589   71.698589  132079200
...                ...         ...         ...         ...        ...
2025-12-22  270.970001  273.880005  270.510010  272.859985   36571800
2025-12-23  272.359985  272.500000  269.559998  270.839996   29642000
2025-12-24  273.809998  275.429993  272.200012  272.339996   17910600
2025-12-26  273.399994  275.369995  272.859985  274.160004   21455300
2025-12-29  273.760010  274.359985  272.350006  274.230011   23399554

[1506 rows x 5 columns]>

In [130]:
df = pd.read_csv('downloads/pet_data.csv')

In [141]:
df[df.duplicated()]

       name    pet_type food_type amount brand
167     NaN         NaN       NaN    NaN   NaN
242  Cooper  Guinea Pig   Pellets    NaN   NaN
261     NaN         NaN       NaN    NaN   NaN
262     NaN         NaN       NaN    NaN   NaN
275   Rocky        Fish   Pellets    NaN   NaN
323  Stella       Snake       NaN    NaN   NaN
485    Luna         Cat       NaN    NaN   NaN

In [136]:
df.shape[0]

500

In [146]:
df[df.duplicated(keep = False)]

       name    pet_type food_type amount brand
28   Cooper  Guinea Pig   Pellets    NaN   NaN
42      NaN         NaN       NaN    NaN   NaN
95     Luna         Cat       NaN    NaN   NaN
144   Rocky        Fish   Pellets    NaN   NaN
152  Stella       Snake       NaN    NaN   NaN
167     NaN         NaN       NaN    NaN   NaN
242  Cooper  Guinea Pig   Pellets    NaN   NaN
261     NaN         NaN       NaN    NaN   NaN
262     NaN         NaN       NaN    NaN   NaN
275   Rocky        Fish   Pellets    NaN   NaN
323  Stella       Snake       NaN    NaN   NaN
485    Luna         Cat       NaN    NaN   NaN

In [159]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob'],
    'age': [25, 30, 25, 35, 30],
    
})

In [160]:
df1.head()

      name  age
0    Alice   25
1      Bob   30
2    Alice   25
3  Charlie   35
4      Bob   30

In [163]:
df.drop_duplicates()

        name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[493 rows x 5 columns]

In [164]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       491 non-null    object
 1   pet_type   490 non-null    object
 2   food_type  434 non-null    object
 3   amount     388 non-null    object
 4   brand      85 non-null     object
dtypes: object(5)
memory usage: 19.7+ KB

In [166]:
df.info

<bound method DataFrame.info of         name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[500 rows x 5 columns]>

In [167]:
df.shape

(500, 5)

In [169]:
df_wo_dup=df.drop_duplicates()

In [171]:
df_wo_dup.shape

(493, 5)

In [172]:
df[]

SyntaxError: invalid syntax (1951995059.py, line 1)

In [173]:
df[df.duplicated()]

       name    pet_type food_type amount brand
167     NaN         NaN       NaN    NaN   NaN
242  Cooper  Guinea Pig   Pellets    NaN   NaN
261     NaN         NaN       NaN    NaN   NaN
262     NaN         NaN       NaN    NaN   NaN
275   Rocky        Fish   Pellets    NaN   NaN
323  Stella       Snake       NaN    NaN   NaN
485    Luna         Cat       NaN    NaN   NaN

In [175]:
df[how='all']

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (2093870476.py, line 1)

In [181]:
df() 
# TIL: to show entire dataframe, just use df .

TypeError: 'DataFrame' object is not callable

In [177]:
df.show()

AttributeError: 'DataFrame' object has no attribute 'show'

In [178]:
df.all()

name         True
pet_type     True
food_type    True
amount       True
brand        True
dtype: bool

In [179]:
print(df)

        name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[500 rows x 5 columns]

In [180]:
df

        name pet_type   food_type amount          brand
0      Simba   Lizard     Insects   212g            NaN
1    Winston   Ferret    Dry Food    NaN        Pawsome
2      Bella   Parrot       Seeds    NaN            NaN
3     Shadow  Hamster     Pellets    58g            NaN
4       Milo   Rabbit  Vegetables   124g            NaN
..       ...      ...         ...    ...            ...
495   Shadow      Dog    Wet Food   229g  TropicalFeast
496     Nala    Snake        Eggs   114g            NaN
497     Finn   Turtle     Pellets    NaN            NaN
498     Finn  Hamster       Seeds    55g            NaN
499     Cleo   Parrot     Pellets   117g            NaN

[500 rows x 5 columns]

In [182]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
495    False
496    False
497    False
498    False
499    False
Length: 500, dtype: bool

In [183]:
df.drop_duplicates(subset = 'name')

        name    pet_type   food_type amount          brand
0      Simba      Lizard     Insects   212g            NaN
1    Winston      Ferret    Dry Food    NaN        Pawsome
2      Bella      Parrot       Seeds    NaN            NaN
3     Shadow     Hamster     Pellets    58g            NaN
4       Milo      Rabbit  Vegetables   124g            NaN
5        Zoe      Ferret    Dry Food   114g            NaN
6     Casper      Rabbit  Vegetables    62g            NaN
7      Gizmo      Lizard     Insects   179g            NaN
8       Lily     Hamster       Seeds   149g            NaN
9      Tiger        Fish     Pellets   173g       ChowTime
11   Mittens         Dog  Dry Kibble    87g            NaN
12      Zeus         Dog    Wet Food    NaN            NaN
13       Leo        Fish         NaN   115g            NaN
14      Lucy         Dog    Wet Food   142g            NaN
16     Rosie         Cat    Wet Food    67g            NaN
18   Charlie         Dog  Dry Kibble    84g   GreenHarvest
19    Harley         Cat    Wet Food    90g        Pawsome
20    Jasper     Hamster     Pellets   167g            NaN
22    Sophie       Snake        Eggs    44g            NaN
24       Max     Hamster       Seeds    NaN            NaN
25      Duke      Rabbit  Vegetables    39g            NaN
27    Cooper      Parrot       Seeds    NaN      SnackLand
29    Tucker      Parrot     Pellets    87g            NaN
32      Lulu      Lizard     Pellets    NaN            NaN
33      Coco      Rabbit  Vegetables    NaN            NaN
34     Rocky      Turtle         NaN   228g            NaN
38     Penny  Guinea Pig     Pellets   119g  TropicalFeast
40     Chloe         Dog    Wet Food   177g            NaN
42       NaN         NaN         NaN    NaN            NaN
45     Buddy       Snake     Rodents   129g            NaN
46      Nala      Parrot     Pellets    31g    GrainyGraze
48     Kitty      Lizard     Insects   136g            NaN
51      Ruby      Lizard     Pellets    97g            NaN
53    Stella       Snake         NaN   231g            NaN
56     Sadie      Ferret    Wet Food   128g            NaN
57      Loki         Dog    Wet Food   173g        Pawsome
60      Luna      Parrot         NaN    NaN            NaN
66     Molly      Lizard     Insects   225g            NaN
67      Lola      Rabbit  Vegetables    99g            NaN
69      Finn       Snake        Eggs    NaN            NaN
70    Oliver        Fish      Flakes   106g            NaN
78     Oscar     Hamster     Pellets    NaN            NaN
87    Bailey  Guinea Pig         NaN   244g            NaN
89     Riley      Ferret    Wet Food    NaN        Pawsome
93     Mocha        Fish         NaN    52g            NaN
108    Daisy         Dog    Wet Food   123g            NaN
174     Cleo      Lizard     Insects    80g            NaN

In [187]:
df.drop_duplicates(subset = 'name').name.value_counts()

name
Simba      1
Winston    1
Bella      1
Shadow     1
Milo       1
Zoe        1
Casper     1
Gizmo      1
Lily       1
Tiger      1
Mittens    1
Zeus       1
Leo        1
Lucy       1
Rosie      1
Charlie    1
Harley     1
Jasper     1
Sophie     1
Max        1
Duke       1
Cooper     1
Tucker     1
Lulu       1
Coco       1
Rocky      1
Penny      1
Chloe      1
Buddy      1
Nala       1
Kitty      1
Ruby       1
Stella     1
Sadie      1
Loki       1
Luna       1
Molly      1
Lola       1
Finn       1
Oliver     1
Oscar      1
Bailey     1
Riley      1
Mocha      1
Daisy      1
Cleo       1
Name: count, dtype: int64

In [188]:

df.name.value_counts()

name
Luna       18
Charlie    18
Lucy       16
Oliver     15
Lily       15
Cooper     14
Oscar      14
Chloe      14
Lola       14
Sophie     13
Winston    13
Shadow     13
Stella     13
Finn       13
Mocha      13
Zoe        12
Nala       12
Kitty      12
Loki       12
Riley      12
Harley     11
Coco       11
Jasper     11
Tiger      10
Sadie      10
Duke       10
Buddy      10
Simba       9
Milo        9
Zeus        9
Mittens     9
Lulu        9
Penny       9
Leo         9
Ruby        9
Rocky       8
Casper      7
Molly       7
Bailey      7
Tucker      7
Max         7
Gizmo       6
Cleo        6
Bella       5
Rosie       5
Daisy       5
Name: count, dtype: int64

In [198]:
df.drop_duplicates(subset = ['name', 'pet_type'])

        name pet_type   food_type amount     brand
0      Simba   Lizard     Insects   212g       NaN
1    Winston   Ferret    Dry Food    NaN   Pawsome
2      Bella   Parrot       Seeds    NaN       NaN
3     Shadow  Hamster     Pellets    58g       NaN
4       Milo   Rabbit  Vegetables   124g       NaN
..       ...      ...         ...    ...       ...
486     Luna  Hamster       Seeds    53g       NaN
489    Rocky   Lizard     Insects   135g  ChowTime
491    Mocha   Turtle     Pellets   249g       NaN
493   Shadow      Dog    Wet Food   176g       NaN
494      NaN   Turtle     Pellets   162g       NaN

[323 rows x 5 columns]

In [199]:
df.drop_duplicates(subset = ['name', 'pet_type'])[['name','pet_type']]

        name pet_type
0      Simba   Lizard
1    Winston   Ferret
2      Bella   Parrot
3     Shadow  Hamster
4       Milo   Rabbit
..       ...      ...
486     Luna  Hamster
489    Rocky   Lizard
491    Mocha   Turtle
493   Shadow      Dog
494      NaN   Turtle

[323 rows x 2 columns]

In [203]:
df = pd.read_csv('customers.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'customers.csv'

In [205]:
df = pd.read_csv('downloads/customers.csv')

In [206]:
df.head()

     ID First Name Last Name         Phone          LTV
0  4576     Sophia    Walker  602-310-9331     $496.87
1  9488     Evelyn    Harris  171-363-6978  $38,424.41
2  7265      Lucas    Foster  139-658-8905  $14,413.64
3  8555     Elijah     Jones  538-241-9868  $13,440.49
4  7023      Mason    Taylor  937-595-5837   $1,777.37

In [207]:
df.rename({'First Name' : 'First_Name'}, axis = 1)

       ID First_Name Last Name         Phone          LTV
0    4576     Sophia    Walker  602-310-9331     $496.87
1    9488     Evelyn    Harris  171-363-6978  $38,424.41
2    7265      Lucas    Foster  139-658-8905  $14,413.64
3    8555     Elijah     Jones  538-241-9868  $13,440.49
4    7023      Mason    Taylor  937-595-5837   $1,777.37
..    ...        ...       ...           ...          ...
995  7099      David    Harris  809-428-6034  $12,799.04
996  6743      Henry     Reyes  999-363-7716  $11,043.94
997  3513     Olivia   Sanders             ?  $10,206.00
998  4307       Emma       Cox  748-415-4613   $9,839.57
999  9062      Henry     Brown  412-368-2550  $14,686.60

[1000 rows x 5 columns]

In [208]:
df.rename(columns={'First Name' : 'First_Name'})

       ID First_Name Last Name         Phone          LTV
0    4576     Sophia    Walker  602-310-9331     $496.87
1    9488     Evelyn    Harris  171-363-6978  $38,424.41
2    7265      Lucas    Foster  139-658-8905  $14,413.64
3    8555     Elijah     Jones  538-241-9868  $13,440.49
4    7023      Mason    Taylor  937-595-5837   $1,777.37
..    ...        ...       ...           ...          ...
995  7099      David    Harris  809-428-6034  $12,799.04
996  6743      Henry     Reyes  999-363-7716  $11,043.94
997  3513     Olivia   Sanders             ?  $10,206.00
998  4307       Emma       Cox  748-415-4613   $9,839.57
999  9062      Henry     Brown  412-368-2550  $14,686.60

[1000 rows x 5 columns]

In [209]:
stock = yf.Ticker('nvda')

In [211]:
stock.financials

,2025-01-31,2024-01-31,2023-01-31,2022-01-31
Tax Effect Of Unusual Items,0.000000e+00,0.000000e+00,-2.841300e+08,0.000000e+00
Tax Rate For Calcs,1.330000e-01,1.200000e-01,2.100000e-01,1.900000e-02
Normalized EBITDA,8.613700e+10,3.558300e+10,7.339000e+09,1.135100e+10
Total Unusual Items,0.000000e+00,0.000000e+00,-1.353000e+09,0.000000e+00
Total Unusual Items Excluding Goodwill,0.000000e+00,0.000000e+00,-1.353000e+09,0.000000e+00
Net Income From Continuing Operation Net Minority Interest,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Reconciled Depreciation,1.864000e+09,1.508000e+09,1.543000e+09,1.174000e+09
Reconciled Cost Of Revenue,3.263900e+10,1.662100e+10,1.161800e+10,9.439000e+09
EBITDA,8.613700e+10,3.558300e+10,5.986000e+09,1.135100e+10
EBIT,8.427300e+10,3.407500e+10,4.443000e+09,1.017700e+10
Net Interest Income,1.539000e+09,6.090000e+08,5.000000e+06,-2.070000e+08
Interest Expense,2.470000e+08,2.570000e+08,2.620000e+08,2.360000e+08
Interest Income,1.786000e+09,8.660000e+08,2.670000e+08,2.900000e+07
Normalized Income,7.288000e+10,2.976000e+10,5.436870e+09,9.752000e+09
Net Income From Continuing And Discontinued Operation,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Total Expenses,4.904400e+10,2.795000e+10,2.139700e+10,1.687300e+10
Total Operating Income As Reported,8.145300e+10,3.297200e+10,4.224000e+09,1.004100e+10
Diluted Average Shares,2.480400e+10,2.494000e+10,2.507000e+10,2.535000e+10
Basic Average Shares,2.455500e+10,2.469000e+10,2.487000e+10,2.496000e+10
Diluted EPS,2.940000e+00,1.190000e+00,1.740000e-01,3.850000e-01
Basic EPS,2.970000e+00,1.210000e+00,1.760000e-01,3.910000e-01
Diluted NI Availto Com Stockholders,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Net Income Common Stockholders,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Net Income,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Net Income Including Noncontrolling Interests,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Net Income Continuous Operations,7.288000e+10,2.976000e+10,4.368000e+09,9.752000e+09
Tax Provision,1.114600e+10,4.058000e+09,-1.870000e+08,1.890000e+08
Pretax Income,8.402600e+10,3.381800e+10,4.181000e+09,9.941000e+09
Other Income Expense,1.034000e+09,2.370000e+08,-1.401000e+09,1.070000e+08
Other Non Operating Income Expenses,1.034000e+09,2.370000e+08,-4.800000e+07,1.070000e+08
Special Income Charges,0.000000e+00,0.000000e+00,-1.353000e+09,0.000000e+00
Restructuring And Mergern Acquisition,0.000000e+00,0.000000e+00,1.353000e+09,0.000000e+00
Net Non Operating Interest Income Expense,1.539000e+09,6.090000e+08,5.000000e+06,-2.070000e+08
Interest Expense Non Operating,2.470000e+08,2.570000e+08,2.620000e+08,2.360000e+08
Interest Income Non Operating,1.786000e+09,8.660000e+08,2.670000e+08,2.900000e+07
Operating Income,8.145300e+10,3.297200e+10,5.577000e+09,1.004100e+10
Operating Expense,1.640500e+10,1.132900e+10,9.779000e+09,7.434000e+09
Research And Development,1.291400e+10,8.675000e+09,7.339000e+09,5.268000e+09
Selling General And Administration,3.491000e+09,2.654000e+09,2.440000e+09,2.166000e+09
Gross Profit,9.785800e+10,4.430100e+10,1.535600e+10,1.747500e+10
Cost Of Revenue,3.263900e+10,1.662100e+10,1.161800e+10,9.439000e+09
Total Revenue,1.304970e+11,6.092200e+10,2.697400e+10,2.691400e+10
Operating Revenue,1.304970e+11,6.092200e+10,2.697400e+10,2.691400e+10

In [212]:
stock.calendar

{'Dividend Date': datetime.date(2025, 12, 25),
 'Ex-Dividend Date': datetime.date(2025, 12, 3),
 'Earnings Date': [datetime.date(2026, 2, 25)],
 'Earnings High': 1.59,
 'Earnings Low': 1.49,
 'Earnings Average': 1.52158,
 'Revenue High': 68755000000,
 'Revenue Low': 64609000000,
 'Revenue Average': 65569688320}

In [213]:
from nasdaq import Nasdaq

# Initialize the API client
client = Nasdaq()

# Get earnings calendar (returns a pandas DataFrame)
earnings_df = client.get_earnings_calendar()

# Preview the data
print(earnings_df.head())

ImportError: cannot import name 'Nasdaq' from 'nasdaq' (C:\Users\vinan\AppData\Local\Programs\Python\Python313\Lib\site-packages\nasdaq\__init__.py)

In [214]:
from nasdaq import Nasdaq

ImportError: cannot import name 'Nasdaq' from 'nasdaq' (C:\Users\vinan\AppData\Local\Programs\Python\Python313\Lib\site-packages\nasdaq\__init__.py)

In [215]:
from nasdaq import nasdaq

ImportError: cannot import name 'nasdaq' from 'nasdaq' (C:\Users\vinan\AppData\Local\Programs\Python\Python313\Lib\site-packages\nasdaq\__init__.py)